using System.Linq;
using KioskBrains.Kiosk.Core.Modals;

namespace KioskApp.Ek.Info
{
    public static class InfoModalHelper
    {
        static InfoModalHelper()
        {
            _userAgreementBlocks = ParseInfoText(_userAgreementText);
            _warrantyBlocks = ParseInfoText(_warrantyText);
            _returnBlocks = ParseInfoText(_returnText);
        }

        public static void OpenInfoModal(InfoModalTypeEnum infoModalType)
        {
            EkContext.Current.EkProcess?.OnViewChanged($"Modal {infoModalType}", false);

#pragma warning disable 4014
            ModalManager.Current.ShowModalAsync(new ModalArgs(
#pragma warning restore 4014
                infoModalType.ToString(),
                context =>
                    {
                        var infoModal = new InfoModal(context);
                        switch (infoModalType)
                        {
                            case InfoModalTypeEnum.Warranty:
                                infoModal.TitlePart1 = "Умови";
                                infoModal.TitlePart2 = "гарантії";
                                infoModal.InfoBlocks = _warrantyBlocks;
                                break;
                            case InfoModalTypeEnum.Return:
                                infoModal.TitlePart1 = "Умови";
                                infoModal.TitlePart2 = "повернення";
                                infoModal.InfoBlocks = _returnBlocks;
                                break;
                            case InfoModalTypeEnum.UserAgreement:
                                infoModal.TitlePart1 = "Згода користувача";
                                infoModal.InfoBlocks = _userAgreementBlocks;
                                break;
                        }

                        return infoModal;
                    },
                showCancelButton: false));
        }

        private static readonly InfoBlock[] _userAgreementBlocks;

        private static readonly InfoBlock[] _warrantyBlocks;

        private static readonly InfoBlock[] _returnBlocks;

        private const string ListItemStart = "- ";

        public static InfoBlock[] ParseInfoText(string infoText)
        {
            if (string.IsNullOrEmpty(infoText))
            {
                return new InfoBlock[0];
            }

            var lines = infoText
                .Replace("\r", "")
                .Split("\n");

            return lines
                .Select(line =>
                    {
                        InfoBlockTypeEnum type;
                        string text;
                        if (string.IsNullOrWhiteSpace(line))
                        {
                            type = InfoBlockTypeEnum.ExtraSpace;
                            text = null;
                        }
                        else if (line.StartsWith(ListItemStart))
                        {
                            type = InfoBlockTypeEnum.ListItem;
                            text = line.Substring(ListItemStart.Length);
                        }
                        else
                        {
                            type = InfoBlockTypeEnum.Paragraph;
                            text = line;
                        }

                        return new InfoBlock()
                            {
                                Type = type,
                                Text = text,
                            };
                    })
                .ToArray();
        }

        #region User Agreement Text

        private static readonly string _userAgreementText = @"1. ЗАГАЛЬНІ ПОЛОЖЕННЯ
1.1. ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «ГлобусКарс», (далі Офіційний партнер) публікує даний Публічний договір (Угода та/або Оферта) про надання послуг через збутову мережу послуг та торгівлі б/в та новими запчастинами, розміщену в терміналах (далі).
1.2. ПРОЧИТАЙТЕ ЦЮ УГОДУ ПЕРЕД ВИКОРИСТАННЯМ НАШОГО ТЕРМІНАЛУ.
1.3. Ця Угода є юридично зобов'язуючим договором між Сторонами та регламентує використання Клієнтом Терміналу.
1.4. Відповідно до статті 633 Цивільного Кодексу України (ЦК України) ця Угода є публічним договором, і у разі прийняття (акцепту) викладених нижче умов будь-яка дієздатна фізична або юридична особа (далі Користувач) зобов'язується виконувати умови цієї Угоди.
1.5. У цій оферті, якщо контекст не вимагає іншого, наведені нижче терміни мають такі значення:
- Оголошення - розміщені в Терміналі текст та графічні зображення, що описують Товар, який пропонує Продавець.
- Оферта – публічна пропозиція Офіційного партнера, адресована будь-якій дієздатній фізичній особі та/або суб'єкту господарювання (юридична особа або фізична особа-підприємець), укласти з нею Публічний договір про надання послуг на умовах, що містяться в цій Угоді, включаючи всі її додатки;
- Акцепт – повне прийняття Клієнтом умов Угоди;
- Офіційний партнер - ТОВАРИСТВО З ОБМЕЖЕНОЮ ВІДПОВІДАЛЬНІСТЮ «ГлобусКарс», юридична адреса: 89600, Закарпатська область, м. Мукачеве, вул. Пряшівська,5а;
- Клієнт – будь-яка дієздатна фізична особа або суб'єкт господарювання (юридична особа або фізична особа-підприємець), яка прийняла умови цієї Угоди та користується послугами Офіційного партнера. Від імені суб'єкта господарювання користування Терміналом здійснюється уповноваженим співробітником/представником такої юридичної особи;
- термінал – це пристрій (програмно-апаратний комплекс) з програмним забезпеченням, який забезпечує доступ Клієнтів до збутової мережі послуг та торгівлі б/у та новими запчастинами;
- Товар – будь-який матеріальний об'єкт (запчастина нова або б/у), який Продавець пропонує для покупки Клієнтам;
- Послуга – сукупність наданих Офіційним партнером відповідно до цієї Угоди послуг для Клієнтів на безоплатній основі, за перевіркою Продавців, розміщення Оголошень Продавців та іншої інформації, гарантування отримання Клієнтом обраного в Терміналі Товару, а також щодо здійснення через Термінал дій, пов'язаних з наданням можливості вибору Продавця, Товару, отриманням документів на оплату та/або оплатою за Товар.
- Продавець - будь-яка дієздатна фізична особа або суб'єкт господарювання (юридична особа або фізична особа-підприємець), який пройшов процедуру перевірки Офіційним партнером, який розміщує оголошення в Терміналі.
- Персональні дані - це відомості чи сукупність відомостей про фізичну особу, яка за їх допомогою ідентифікована або може бути конкретно ідентифікована.
1.6. Якщо Клієнт не погоджується з Угодою повністю або частково, Офіційний партнер просить його припинити використання Терміналу. Ці умови регулюють використання Терміналу. Використання Терміналу означає, що Клієнт ознайомлений з цією Угодою, розуміє та приймає її умови.
1.7. Цей Офіційний партнер пропонує Клієнтам використовувати свої Термінали на умовах, викладених у цій Угоді.
1.8. Офіційний партнер для цілей цієї Угоди на підставі договору про співробітництво та взаємодію з Продавцем, за винагороду вчиняє дії з надання збутової мережі для продажу товарів і послуг Продавця, гарантує благонадійність Продавця та виконання Продавцем зобов'язань по поставці Товару, що відповідає наведеним в Оголошенні , сприяє у здійсненні Клієнтами оплати за Товар.

2. ПОРЯДОК НАДАННЯ ТА ВИКОРИСТАННЯ ПОСЛУГ
2.1. Особа, яка бажає стати Клієнтом та здійснити замовлення Товару через термінал, зобов'язана пройти процедуру ідентифікації та вказати у відповідних полях інформацію про себе.
2.2. Клієнт самостійно, керуючись своїми власними побажаннями та потребами, здійснює вибір необхідного Товару та Продавця.
2.3. За допомогою Терміналу Клієнт робить дії щодо оформлення замовлення на обраний Товар, а саме: вводить свої реквізити; вибирає організацію, яка здійснюватиме доставку Товару, а також інші дії, необхідні для здійснення замовлення Товару.
2.4. Після того, як Клієнт проведе всі необхідні дії для формування замовлення, він отримує документ з реквізитами для оплати або документ з детальною інформацією про посередника, до якого необхідно звернутися для отримання всіх необхідних документів для оплати.
2.5. Офіційний партнер не гарантує доступності Терміналів цілодобово.
 
3. ПРАВА ТА ОБОВ'ЯЗКИ ОФІЦІЙНОГО ПАРТНЕРА
3.1. Обов'язки Офіційного партнера полягають у забезпеченні можливості отримання Клієнтом Послуг у порядку, визначеному цією Угодою.
3.2. Офіційний партнер залишає за собою право на власний розсуд змінювати або видаляти будь-яку інформацію, що публікується в Терміналі, зупиняти, обмежувати або припиняти доступ Клієнтів до Терміналів у будь-який час з будь-якої причини.
3.3. Офіційний партнер має право встановлювати будь-які обмеження у використанні Терміналу Клієнтами.
3.4. Офіційний партнер має право розміщувати рекламну та/або іншу інформацію у будь-якому розділі Терміналу без погодження з Клієнтом.
3.5. У разі порушення Клієнтом умов цієї Угоди, Офіційний партнер має право припиняти, обмежувати або припиняти доступ такого Клієнта до будь-якого з Терміналів в односторонньому порядку в будь-який час, не несучи відповідальності за будь-яку шкоду, яка може бути заподіяна Клієнту такими діями.
3.6. Офіційний партнер має право розсилати Клієнтам повідомлень, у тому числі електронних повідомлень на адреси електронної пошти Клієнта або SMS-повідомлень на номери мобільних телефонів Клієнта, які містять організаційно-технічну, інформаційну або іншу інформацію про Послуги.
3.7. Офіційний партнер зобов'язується надати Клієнту можливість отримання консультацій служби технічної підтримки Офіційного партнера за телефоном та/або електронною поштою.
3.8. Офіційний партнер має право здійснювати модерацію всіх Оголошень та у будь-який момент на свій розсуд видаляти їх з розміщення в Терміналі без пояснення причин.
3.9. Офіційний партнер зобов'язаний виконувати інші обов'язки, встановлені цією Угодою.
 
4. ПРАВА ТА ОБОВ'ЯЗКИ КЛІЄНТА
4.1. Клієнт зобов'язується виконувати умови цієї Угоди.
4.2. Клієнт зобов'язується самостійно ознайомлюватися з інформацією щодо умов надання йому Послуг.
4.3. Клієнт має право вимагати від Офіційного партнера надання йому Послуг відповідно до умов цієї Угоди.
4.4. Клієнт має право звертатися до служби технічної підтримки Офіційного партнера, повідомляючи при цьому свої контактні дані.
4.5. Клієнт зобов'язується не здійснювати дії, спрямовані на дестабілізацію роботи Терміналу, а також від будь-яких інших дій, що порушують права Офіційного партнера та/або третіх осіб.
4.6. Клієнт цим підтверджує, що він є повністю дієздатним (щодо фізичних осіб), правоздатним (щодо юридичних осіб), над ним не встановлено піклування у будь-якій формі.
4.7. Клієнт повинен провести огляд Товару, отриманого від Продавця, на місці отримання Товару від організації, яка здійснюватиме доставку на відповідність заявленим Продавцем технічним характеристикам, цілісність та комплектність.
4.8. Клієнт може мати інші права та нести інші обов'язки, встановлені цим Договором.
 
5. ПОРЯДОК ПРОВЕДЕННЯ ОПЛАТИ
5.1. Оплата коштів за Товар здійснюється Клієнтом на рахунок Офіційного партнера.
5.2. Після поставки Товару та виконання Продавцем всіх його зобов'язань перед Клієнтом, Офіційний партнер перераховує на рахунок Продавця усі отримані за Товар кошти. Таким чином, Офіційний партнер гарантує виконання Продавцем всіх його зобов'язань перед Клієнтом та сприяє у здійсненні клієнтами оплати за Товар, але не є кінцевим вигодонабувачем.
5.3. Повернення сплачених Клієнтом коштів за Товар здійснюється Офіційним партнером при виконанні наступних умов:
5.3.1. Товар пошкоджений та/або не відповідає комплектності/технічним характеристикам, заявленим Продавцем в Оголошення;
5.3.2. Клієнт не підписав документи отримання Товару;
5.3.3. Клієнт повідомив про це протягом 1 (одного) робочого дня на гарячу лінію Офіційного партнера.
 
6. ВІДПОВІДАЛЬНІСТЬ. ОБМЕЖЕННЯ ВІДПОВІДАЛЬНОСТІ ОФІЦІЙНОГО ПАРТНЕРА
6.1. Сторони несуть відповідальність за невиконання або неналежне виконання умов цієї Угоди у порядку, передбаченому цією Угодою та чинним законодавством України.
6.2. Відповідальність Клієнта:
6.2.1. Клієнт несе відповідальність за надання достовірної інформації про себе (ПІБ/назва, адреса доставки тощо), а також інформації, необхідної для доставки Товару.
6.2.2. Клієнт несе відповідальність за вибір Продавця, вибір Товару, його оплату та вибір організації, яка здійснюватиме доставку Товару.
6.2.3. Клієнт несе відповідальність за перевірку Товару, отриманого від Продавця, на місці отримання Товару від організації, яка здійснюватиме доставку на відповідність заявленим Продавцем технічним характеристикам, цілісність та комплектність.
6.3. Відповідальність Офіційного партнера:
6.3.1. Офіційний партнер несе відповідальність за рекламу, розміщену в Терміналах, у межах, встановлених чинним законодавством.
6.3.2. Офіційний партнер несе відповідальність за цілісність та комплектацію отриманих Клієнтом Товарів, а також за відповідність Товару, придбаного Клієнтом, технічним характеристикам, викладеним у оголошенні.
6.3.3. Офіційний партнер контролює достовірність інформації, що розміщується Продавцями в оголошеннях.
6.3.4. Офіційний партнер зобов'язаний повернути оплачені Клієнтом кошти за Товар, якщо Клієнт отримав Товар з видимими пошкодженнями, Товар, який не в тій комплектації або не з тими технічними характеристиками, що були заявлені в оголошенні.
6.4. Обмеження відповідальності Офіційного партнера:
6.4.1. Офіційний партнер не несе відповідальності за дії третіх осіб та суміжних служб, що використовуються для надання послуг Клієнту, але не належать Офіційному партнеру: митниця, банки, поштові та кур'єрські служби, інтернет-провайдери, e-mail-сервіси, платіжні системи тощо. .
6.4.2. Офіційний партнер не несе відповідальності за якість Товару, його приховані недоліки/дефекти, а також не гарантує Товари, придбані Клієнтом. Притензії щодо якості та гарантійних обов'язків Клієнт пред'являє на пряму Продавцю, не залучаючи Офіційного партнера, разом з цим Офіційний партнер повідомляє Клієнтів, що:
1) Якщо інший вид Товару підлягає поверненню Продавцю через його дефект, і він уже встановлювався на автомобіль, Клієнт повинен оформити претензію на адресу Продавця, надавши такі документи:
- довідку та укладання сервісної станції про проведення робіт із встановлення даного Товару на автомобіль Клієнта та його непридатність;
- копію замовлення-наряду автосервісу, де проводилася установка Товару на автомобіль;
- копію ліцензії даного сервісу на проведення робіт із встановлення цього виробу та обслуговування даного типу автомобіля;
- копію сертифіката відповідності надання послуг, що надаються сервісом;
- Документ, що підтверджує факт придбання Товару у Продавця.
Звертаємо увагу, що у претензії Клієнту може бути відмовлено Продавцем у разі самостійної установки запчастин.
2) Продавець не несе гарантійних зобов'язань, якщо має місце:
- нормальне та природне для певного терміну експлуатації знос деталі;
- пошкодження деталі внаслідок ДТП, неправильної її установки чи недбалої експлуатації, або будь-яке інше механічне пошкодження;
- несправність запасних частин паливної системи або системи випуску внаслідок використання класу палива, моторного масла, не передбачених виробником автомобіля або інших технічно несумісних/непередбачених деталей;
- пошкодження (особливо деталей підвіски та рульового управління), що виникли через неакуратне водіння на нерівностях дороги або внаслідок суттєвих дефектів дорожнього покриття;
- встановлення деталі Клієнтом самостійно або на СТО, що не має сертифіката на проведення цього виду робіт.
6.4.3. Офіційний партнер не несе відповідальності за терміни доставки та якість доставки Товару, оскільки доставка здійснюється спеціалізованими організаціями.
6.4.3. Офіційний партнер не несе відповідальності за відповідність заявленим Продавцем технічним характеристикам, цілісність та комплектність Товару, якщо Клієнт підписав документи на отримання Товару та/або не повідомив про це протягом 1 (одного) робочого дня на гарячу лінію Офіційного партнера.
 
7. УРЕГУЛЮВАННЯ СПОРІВ
7.1. У разі виникнення розбіжностей та спорів, пов'язаних із виконанням умов цієї Угоди, Сторони вирішують їх шляхом переговорів. Якщо суперечки не будуть вирішені шляхом переговорів, суперечки підлягають вирішенню у порядку, встановленому законодавством України. У разі виникнення неврегульованих претензій між сторонами кожна з них може захищати свої порушені права у порядку, встановленому законодавством України.
7.2. У разі якщо згоди не буде досягнуто, всі суперечки з приводу виконання цієї Угоди вирішуються у судовому порядку відповідно до чинного законодавства України.
7.3. У разі виникнення спорів між Продавцем та Клієнтом, пов'язаних з якістю Товару, його гарантійною заміною, ці спори вирішуються самостійно між Продавцем та Клієнтом без залучення Офіційного партнера.

8. ФОРС-МАЖОР
8.1. Сторони звільняються від відповідальності за часткове або повне невиконання зобов'язань згідно з цією Угодою, якщо це невиконання стало наслідком обставин непереборної сили, що виникли після укладення Угоди внаслідок подій надзвичайного характеру, які учасник не міг ні передбачити, ні запобігти розумним заходам (форс-мажор). До таких подій надзвичайного характеру відносяться: повінь, пожежа, землетрус, вибух, шторм, епідемія та інші явища природи, а також війна чи воєнні дії тощо.
8.2. Сторони не несуть відповідальності за будь-які збитки, включаючи збитки, а також витрати, пов'язані з претензіями або вимогами третіх осіб, які можуть виникнути внаслідок обставин непереборної сили.
8.3. У разі форс-мажорних обставин встановлені строки виконання зобов'язань, зазначених у Угоді, переносяться на строк, протягом якого діють ці форс-мажорні обставини.

9. ТЕРМІН ДІЇ УГОДИ І ПРИПИНЕННЯ НАДАННЯ ПОСЛУГ
9.1. Датою укладення Угоди та моментом повного та беззаперечного прийняття Клієнтом умов цієї Угоди є дата початку використання Терміналу та позначка Клієнта про прийняття всіх умов у відповідному розділі у Терміналі та діє безстроково.
9.2. Офіційний партнер має право в односторонньому порядку припинити надання всіх Послуг за порушення Клієнтом будь-якої з умов цієї Угоди.
9.3. Якщо Клієнт надає про себе неправильну інформацію або Офіційний партнер має серйозні підстави вважати, що надана Клієнтом інформація неправильна, неповна або неточна, Офіційний партнер має право відмовити Клієнту у використанні своїх Послуг повністю або частково.
9.4. Офіційний партнер має право припинити надання Послуг при завданні Клієнтом збитків Офіційним партнером або третім особам шляхом непрямого порушення умов цієї Угоди.
9.5. Офіційний партнер не несе відповідальності за повідомлення або не сповіщення будь-яких третіх сторін про припинення дії Угоди та за можливі наслідки, що виникли внаслідок такого попередження або його відсутності.

10. ІНТЕЛЕКТУАЛЬНА ВЛАСНІСТЬ
10.1. Сукупність програм, даних, торгових марок, об'єктів авторського права та інших об'єктів, що використовуються в Терміналі, є інтелектуальною власністю його законних правовласників та охороняється законодавством про інтелектуальну власність України, а також відповідними міжнародними правовими договорами та конвенціями. Будь-яке використання розміщених у Терміналі елементів, символіки, текстів, графічних зображень, програм та інших об'єктів, крім дозволеного у цьому Договорі, без дозволу Офіційного партнера чи іншого законного правовласника є незаконним і може спричинити судовий розгляд та залучення порушників до цивільно-правової, адміністративної та кримінальної відповідальності відповідно до законодавства України.

11. ВНЕСЕННЯ ЗМІН ДО УГОДИ
11.1. З метою покращення якості послуг, що надаються у Терміналах, для дотримання вимог законодавства та реагування на зміну ринкових умов, ця Угода може бути змінена Офіційним партнером в односторонньому порядку. Нова редакція Угоди набирає чинності з її розміщення в Терміналах, якщо інше не передбачено новою редакцією Угоди.
11.2. Поточна Угода, розміщена в Терміналі, скасовує дію попередньої.
 
12. НЕДІЙНІСТЬ ОДНОГО АБО КІЛЬКАХ ПОЛОЖЕНЬ
12.1. Недійсність будь-якого пункту цієї Угоди не впливає на дійсність інших положень.
12.2. Якщо одне з положень цієї Угоди є недійсним, або неприйнятним у цих обставинах, натомість положення сторони застосовують інше, яке є прийнятним, враховує всі обставини та максимально відповідає положенням та умовам цієї Угоди.
 
13. ЗАХИСТ ПЕРСОНАЛЬНИХ ДАНИХ
13.1. Укладаючи цю Угоду, Клієнт підтверджує, що цілком і повністю ознайомлений та згоден з його умовами, а також, у разі, якщо Клієнт є фізичною особою, дає дозвіл на обробку Офіційному партнеру своїх персональних даних з метою можливості виконання умов цього Договору, можливості проведення взаєморозрахунків, а також для отримання рахунків, актів та інших документів. Дозвіл на обробку персональних даних діє протягом усього терміну дії Угоди. Крім цього, укладанням цієї Угоди Клієнт підтверджує, що він повідомлений (без додаткового повідомлення) про права, встановлені Законом України «Про захист персональних даних», про цілі збору даних, а також про те, що його персональні дані передаються Офіційному партнеру з метою можливості виконання умов цієї Угоди, можливості проведення взаєморозрахунків, а також отримання рахунків, актів та інших документів. Клієнт також погоджується з тим, що Офіційний партнер має право надавати доступ та передавати його персональні дані третім особам без будь-яких додаткових повідомлень Клієнта, не змінюючи при цьому мету обробки персональних даних. Обсяг прав Клієнта як суб'єкта персональних даних відповідно до Закону України «Про захист персональних даних» йому відомий та зрозумілий.
 
14. ІНШІ УМОВИ
14.1. Ця Угода та відносини між Офіційним партнером та Клієнтом регулюються законодавством України. Питання, які не врегульовані Угодою, підлягають вирішенню відповідно до законодавства України.
14.2. Клієнт має право надсилати скарги з питань роботи Терміналу на електронну пошту: info@ek4car.com";

        #endregion

        #region Warranty Text

        private static readonly string _warrantyText = @"Продавець та Покупець у питаннях повернення, обміну та гарантійного ремонту товару зобов'язані керуватися Цивільним Кодексом України (ДКУ) та Законом України «Про захист прав споживачів».
Відповідно до ст. 9 Закону «Про захист прав споживачів», Покупець має право обміняти товар належної якості на аналогічний протягом 14 днів без урахування дня покупки, якщо товар не задовольнив його за формою, габаритами, фасоном, кольором, розміром або з інших причин не може бути їм використаний за призначенням.
Обмін товару належної якості можливий лише у певних випадках:
- Якщо товар не використовувався. Встановлення додатків, зміна налаштувань із заводських, склеювання чи стирання захисних плівок, та подібні дії є підтвердженням використанням товару.
- якщо збережено товарний вигляд та споживчі властивості.
- Якщо збережено пломби, ярлики, частини оригінальної упаковки. Те саме стосується пом'ятої або потертої, упаковки, зриву наклейок і ярликів.
- якщо збережено розрахунковий документ, виданий Покупцеві разом із проданим товаром.
Тільки в тому випадку, якщо Продавець не має аналогічних товарів, Покупець має право вибрати будь-який інший товар з наявного асортименту з перерахуванням вартості або вимагати повернення грошей. У разі, якщо Продавця виникли сумніви щодо того, що товар був у вжитку, або міг втратити товарний вигляд з вини Покупця, Продавець направляє товар на експертизу відповідальній особі Продавця. Термін проведення експертизи становить до 14 днів.
Відповідно до ст.8 Закону «Про захист прав споживачів», Покупець, якщо він виявив недоліки товару протягом гарантійного терміну, має право пред'явити претензії до Продавця, зокрема вимагати безоплатного усунення недоліків товару.
Під недоліками товару у зазначеному законі розуміються лише невідповідність товару нормативним документам на даний вид товару, специфікаціям виробника та інформації, отриманої від Продавця.
Таким чином, відповідно до законодавства, не є недоліками товару:
- Невідповідність товару очікуванням чи бажанням Покупця.
- Не сумісність товару із стороннім обладнанням, аксесуарами, програмним забезпеченням, що явно не зазначені у специфікаціях на товар та інформації Продавця.
Відповідно до ст. 700 ЦКУ, Покупець не має права вимагати відшкодування вартості товару через ненадання інформації про товар, оскільки:
- Продавець надав Покупцеві можливість перед покупкою отримати будь-яку інформацію про товар, що цікавить Покупця, шляхом публікації характеристик і фотографій товару на торговому майданчику Автомагазин термінал Автозапчастини24.
- Покупець мав можливість оглянути товар і перевірити будь-які властивості товару, що його цікавлять, в момент отримання товару.
Відповідно до ст. 702 ЦКУ, Покупець, який замовляє товар в Автомагазині терміналі Автозапчастини24, має право відмовитися від отримання товару за умови відшкодування Продавцю витрат, пов'язаних із виконанням доставки (кур'єрські, поштові послуги в обидва кінці) та митні витрати.
Тільки у разі виявлення суттєвих недоліків товару, Покупець має право на свій вибір вимагати у Продавця усунення суттєвих недоліків чи повернення сплачених за товар грошей.
Під істотним недоліком у Законі «Про захист прав споживачів» розуміється недолік, який призводить товар у непридатність, виник з вини виробника або Продавця, після його усунення проявляється знову з незалежних від Покупця причин, і при цьому його взагалі неможливо усунути, або можливо усунути лише за 14 днів.
Таким чином, не є суттєвими недоліками товару:
- Недоліки, що не призводять до непридатності товару
- Недоліки, які можна усунути протягом 14 днів.
- Невідповідність товару очікуванням чи бажанням Покупця.
Визначення факту використання товару, а також наявності в ньому недоліків або суттєвих недоліків визначається рішенням акта експертизи, складеного відповідальною особою Продавця або виробника в 14-денний термін з дня отримання товару на експертизу.
У тому випадку, якщо актом експертизи встановлено, що товар не використовувався або має суттєву нестачу, яку неможливо усунути у 14-денний термін, і при цьому Покупець подає письмову заяву про повернення грошей, ця вимога задовольняється у 7-денний термін.
Гарантійні зобов'язання Продавця припиняються у разі:
- використання товару не за призначенням
- приміщення товару під вплив високих або низьких температур, рідин, прямого сонячного випромінювання.";

        #endregion

        #region Return Text

        private static readonly string _returnText = @"Повернення вживаних запчастин при покупці в Автомагазині терміналі Автозапчастини 24 здійснюється за дотриманням певних умов.
Повернення б/у запчастин (вузлів, агрегатів) можливе тільки через їх несправність (гарантійний випадок), б/у запчастини не підлягають поверненню через помилку замовлення товару або іншу причину.
При настанні гарантійного випадку повернення б/у автозапчастини (вузла, агрегату) має бути здійснене протягом гарантійного періоду. Якщо гарантійний випадок стався в останній день гарантійного періоду, то покупець повинен негайно сповістити про це продавця та здійснити повернення деталі протягом 3 (трьох) днів з моменту виявлення несправності. У разі відправки автозапчастин (вузлів, агрегатів) до інших міст, автозапчастину (вузол, агрегат) необхідно здати до транспортної компанії у вказаний термін для відправки продавцю.
Гарантійні умови поширюються лише на автозапчастини (вузли, агрегати), встановлені у сертифікованих С.Т.О. (Станція технічного обслуговування).
При виявленні браку/дефекту/несправності покупець повинен негайно сповістити про це продавця.
Поверненню та обміну за гарантією підлягають автозапчастини (вузли, агрегати) за наявності товарного чека, замовлення наряду на відповідні роботи, акта про виявлення несправності, а також копії сертифіката С.Т.О на проведення цього виду робіт.
Якщо інший вид товару підлягає поверненню через його дефект, і він уже встановлювався на автомобіль, Вам необхідно оформити претензію та надіслати на e-mail info@ek4car.com, надавши наступні документи:
- довідку та укладання сервісної станції про проведення робіт із встановлення даного товару на автомобіль клієнта та його непридатності;
- копію замовлення-наряду автосервісу, де проводилася установка товару на автомобіль;
- копію ліцензії даного сервісу на проведення робіт із встановлення цього виробу та обслуговування даного типу автомобіля;
- копію сертифіката відповідності надання послуг, що надаються сервісом;
- Документ, що підтверджує факт придбання Товару у Продавця.
Звертаємо Вашу увагу на те, що у претензії Вам може бути відмовлено у разі самостійного встановлення запчастин.
Продавець не несе гарантійних зобов'язань, якщо має місце:
- нормальне та природне для певного терміну експлуатації знос деталі;
- пошкодження деталі внаслідок ДТП, неграмотної її установки чи недбалої експлуатації, або будь-яке інше механічне пошкодження;
- несправність запасних частин паливної системи або системи випуску внаслідок використання класу палива, моторного масла, не передбачених виробником автомобіля або інших технічно несумісних/непередбачених деталей;
- пошкодження (особливо деталей підвіски та рульового управління), що виникли через неакуратне водіння на нерівностях дороги або внаслідок суттєвих дефектів дорожнього покриття;
- встановлення деталі клієнтом самостійно або на СТО, що не має сертифікату на проведення цього виду робіт.
Гарантійні зобов'язання є дійсними під час експлуатації автозапчастини (вузла, агрегату) відповідно до норм та рекомендацій виробника.
Гарантійні зобов'язання не поширюються на деталі, що мають сліди розтину або з порушеними мітками.
Гарантійний термін на вживані автозапчастини (гарантійний період) – 5 (п'ять) днів від дня продажу, якщо інше не обумовлено заздалегідь та не зазначено у товарній накладній.
У разі відправки автозапчастин до інших міст гарантійний термін обчислюється від дати отримання вантажу до транспортної компанії за умови, що вантаж забирається у період безкоштовного зберігання. В іншому випадку гарантійний термін обчислюється від дати закінчення періоду безкоштовного зберігання.
У разі повернення або обміну вживаного автозапчастини (вузла, агрегату) за гарантією витрати понесені покупцем при купівлі, транспортуванні, встановленні та інші витрати продавцем не компенсуються.
- Покупець має право зробити обмін товару за умови відшкодування Продавцю витрат, пов'язаних із виконанням доставки (кур'єрські, поштові послуги в обидва кінці) та митні витрати.
- Якщо покупець придбав кілька найменувань товару та отримав загальну знижку, то при поверненні хоча б одного найменування товару знижка обнулюється.";

        #endregion
    }
}